Repository: RaD/django-south
Catalog: docs/locale/*/LC_MESSAGES/about.po
Languages: ru

source: About South
ru: О South

source: South brings migrations to Django applications. Its main objectives are to provide a simple, stable and database-independent migration layer to prevent all the hassle schema changes over time bring to your Django applications.
ru: South добавляет миграции в приложения Django. Его главная цель заключается в предоставление миграций (простых, стабильных и независящих от типа используемой базы данных), которые упрощают задачи изменения схемы базы данных для ваших приложений.

source: We try to make South both as easy-to-use and intuitive as possible, by making it automate most of your schema-changing tasks, while at the same time providing a powerful set of tools for large or complex projects; you can easily write your own migrations by hand, or even use the database altering API directly.
ru: Мы постарались сделать South простым в использовании и интуитивно понятным насколько это было возможно, автоматизировав большинство задач по изменению схемы базы данных. В тоже время мы предоставляет мощный набор инструментов для больших или сложных проектов. Вы спокойно можете писать свои миграции вручную или даже использовать API управления базой данных напрямую.

source: While South started as a relative unknown in the Django database-schema-altering world, it has slowly risen in popularity and is now widely regarded as the most popular schema migration tool for Django.
ru: Несмотря на то, что South начал своё существование как относительно неизвестное приложение в мире инструментов управления схемой базы данных в Django, он постепенно стал популярным и в настоящее время является основным инструментом миграции схемы для Django.

source: Key features
ru: Ключевые особенности

source: South has a few key features:
ru: South обладает несколькими ключевыми особенностями:

source: Automatic migration creation: South can see what's changed in your models.py file and automatically write migrations that match your changes.
ru: Автоматическое создание миграций: South может найти изменения в вашем файле models.py и автоматически создать миграции для этих изменений.

source: Database independence: As far as possible, South is completely database-agnostic, supporting five different database backends.
ru: Независимость от типа базы данных: Насколько это возможно, South отвязан от базы данных, поддерживая пять различных бэкэндов баз данных.

source: App-savvy: South knows and works with the concept of Django apps, allowing you to use migrations for some of your apps and leave the rest to carry on using syncdb.
ru: Поддержка приложений: South знает и соответствует концепции приложений Django, позволяя вам использовать миграции для некоторых ваших приложений, оставляя остальные заботы утилите syncdb.

source: VCS-proof: South will notice if someone else commits migrations to the same app as you and they conflict.
ru: Контроль версий: South уведомит о ситуации, если кто-то закоммитил миграции в то же приложение, что и вы, вызвав конфликт миграций.

source: A brief history
ru: Историческая справка

source: South was originally developed at `Torchbox <http://www.torchbox.com>`_ in 2008, when no existing solution provided the workflow and features that were needed. It was open-sourced shortly thereafter, and quickly gained steam after the Schema Evolution panel at DjangoCon 2008.
ru: South был разработан в `Torchbox <http://www.torchbox.com>`_ в 2008 году, во времена когда не существовало решений в этой сфере. Его исходний код вскоре стал открытым и быстро получил поддержку на стенде Schema Evolution на DjangoCon 2008.

source: Sometime in 2009, it became the most popular of the various migration alternatives, and seems to have been going strong ever since. While there have been growing calls to integrate South, or something like it, into Django itself, such an integration has not yet been made, mostly due to the relative immaturity of database migration solutions.
ru: В 2009 году он стал самым популярным среди аналогичных инструментов и, кажется, с тех пор стал более продвинутым. Несмотря на участившиеся запросы о включении South или его аналога в код Django, эта интеграция не была осуществлена в основном из-за относительной незрелости решений в сфере миграции баз данных.
