Repository: RaD/django-south
Catalog: docs/locale/*/LC_MESSAGES/autodetector.po
Languages: ru

source: The Autodetector
ru: Автоопределение

source: The autodetector is the part of South you'll probably be using the most, as well as being the feature that people seem to like the most.
ru: Модуль автоопределения является частью South, которую вы возможно используете чаще всего и которую пользователи особенно обожают.

source: The general use of the autodetector is covered in :ref:`tutorial-part-1`; this is more of a reference of what it's capable of.
ru: Стандартное использование модуля автоопределения описано в :ref:`tutorial-part-1`. Здесь мы рассмотрим его возможности подробнее.

source: When the autodetector runs, it compares your current models with those frozen in your most recent migration on the app, and if it finds any changes, yields one or more Actions to the South migration-file-writer.
ru: При запуске модуля автоопределения он сравнивает ваши текущие модели с замороженным состоянием базы данных из последней миграции в приложении. Если модуль находит какое-либо различие между ними, он генерирует одно или несколько действий для модуля записи миграции.

source: Supported Actions
ru: Поддерживаемые действия

source: Model creation and deletion
ru: Создание и удаление модели

source: South will happily detect the creation and deletion of models; this is the oldest and most well-worn feature of the autodetector, and so has very few caveats.
ru: South успешно определяет создание и удаление моделей. Это старейший функционал модуля автоопределения и у него мало недостатков.

source: One thing to note is that, while South calls the post_syncdb hook on your models (much like ``syncdb`` does), it calls it when it initially creates the table, not at the end of the migration, so your hook might well get called when the model doesn't have its full table.
ru: Следует отметить, что хотя South вызывает обработчик post_syncdb для ваших моделей (аналогично тому, как это делает ``syncdb``), обработчик вызывается при самом создании таблицы, а не в конце миграции. Таким образом, ваш обработчик может быть вызван в момент, когда для модели ещё не создана и не заполнена соответствующая таблица.

source: Consider moving your hook code into its own data migration, or use one of our own :ref:`signals`.
ru: Рассмотрите возможность переноса кода вашего обработчика в соответствующую миграцию данныз или воспользуйтесь одним из :ref:`signals`.

source: Field addition and removal
ru: Добавление и удаление поля

source: South detects addition and removal of fields fine, and should correctly create indexes and constraints for new fields.
ru: South отлично распознаёт добавление и удаление полей и должен корректно создавать индексы и ограничения целостности для новых полей.

source: Note that when you add or remove a field, you need a default specified; there's more explanation on this in the :ref:`tutorial-part-2-defaults` part of the tutorial.
ru: Следует отметить, что при создании или удалении поля вам потребуется указать значение по-умолчанию. Более подробно этот момент описан в разделе :ref:`tutorial-part-2-defaults` учебника.

source: Field changes
ru: Изменения поля

source: South will detect if you change a field, and should correctly change the field type, with one exception:
ru: South распознаёт изменение поля и должен корректно изменять его тип, но с одним исключением:

source: If you alter to a field with a CHECK constraint (e.g. ``PositiveIntegerField``) the constraint won't be added to the column (it is removed if you alter away, however). This will be fixed in a future release.
ru: Если вы изменяете поле с ограничением целостности CHECK (например, ``PositiveIntegerField``), то соответствующее ограничение целостности не будет добавлено на поле (но оно удалится в обратном случае). Это поведение планируется исправить в следующем релизе.

source: ManyToMany addition and removal
ru: Добавление и удаление связи многие-ко-многим

source: ManyToMany fields are detected on addition and removal; when you add the field, South will create the table the ManyToMany represents, and when you remove the field, the table will be deleted.
ru: Поля многие-ко-многим определяются при добавлении и удалении. При добавлении такого поля South создаёт соответствующую таблицу для связей, а при удалении поля эта таблица удаляется.

source: The one exception to this is when you have a 'through model' (i.e. you're using the ``through=`` option) - since the table for the model is already created when the model is detected, South does nothing with these types of ManyToMany fields.
ru: Есть одно исключение -- если поле имеет атрибут ``through``, то есть таблица для модели была создана ранее, то South не трогает эту таблицу при добавлении и удалении соответствующего поля.

source: Unique changes
ru: Изменения уникальности

source: If you change the ``unique=`` attribute on a field, or the ``unique_together`` in a model's Meta, South will detect and change the constraints on the database accordingly (except on SQLite, where we don't yet have the code to edit UNIQUE constraints).
ru: Если вы изменили атрибут ``unique`` поля или атрибут ``unique_toghether`` класса Meta, South распознает это и изменит ограничения целостности в базе данных соответственно (в случае SQLite такого не произойдёт, так как соответствующий код ещё не написан).

source: Multicolumn index changes
ru: Изменения индекса из нескольких полей

source: Django 1.5 introduced ``index_together`` in a model's Meta, allowing you to specify multicolumn indexes. South will detect and change the indexes on the database accordingly.
ru: Django 1.5 поддерживает атрибут ``index_together`` класса Meta в моделях, позволяя вам определять индекс из нескольких полей. South распознаёт такой индекс и выполняет в базе данных соответствующие изменения.
