Repository: RaD/django-south
Catalog: docs/locale/*/LC_MESSAGES/convertinganapp.po
Languages: ru

source: Converting An App
ru: Адаптация приложения

source: Converting an app to use South is very easy:
ru: Адаптировать приложение для использования South несложно:

source: Edit your settings.py and put 'south' into `INSTALLED_APPS` (assuming you've installed it to the right place)
ru: Отредактируйте ваш settings.py и укажите `south` в `INSTALLED_APPS` (мы предполагаем, что вы установили south туда, куда нужно)

source: Run ``./manage.py syncdb`` to load the South table into the database. Note that syncdb looks different now - South modifies it.
ru: Запустите ``./manage.py syncdb`` для того, чтобы загрузить таблицу South в базу данных. Обратите внимание, что теперь syncdb не такой как раньше - South его изменил.

source: Run ``./manage.py convert_to_south myapp`` - South will automatically make and pretend to apply your first migration.
ru: Запустите ``./manage.py convert_to_south myapp`` - South автоматически подготовит и выполнит первую миграцию.

source: Note that you'll need to convert before you make any changes; South detects changes by comparing against the frozen state of the last migration, so it cannot detect changes from before you converted to using South.
ru: Следует отметить, что Вы должны адаптировать приложение до того, как вы сделаете изменения; South обнаруживает изменения по сравнению с замороженным состоянием последней миграции, так что он не сможет обнаружить изменения, сделанные до адаптирования к South.

source: Converting other installations and servers
ru: Адаптирование других установок и серверов

source: The convert_to_south command only works entirely on the first machine you run it on. Once you've committed the initial migrations it made into your VCS, you'll have to run ``./manage.py migrate myapp 0001 --fake`` on every machine that has a copy of the codebase (make sure they were up-to-date with models and schema first).
ru: Команда convert_to_south работает целиком на первой машине, на которой Вы его запустите. После того, как вы подтвердите начальную миграцию, которую он сделал, в системе управления версиями, вы должны запустить ``./manage.py migrate myapp 0001 --fake`` на всех машинах, которые содержат копию кода (сначала убедитесь, что они имеют обновлённый код и схему).

source: (For the interested, this is required because the initial migration that convert_to_south makes will try and create all the existing tables; instead, you tell South that it's already applied using --fake, so the next migrations apply correctly.)
ru: (Для тех, кому интересно, это нужно поскольку начальная миграция, которую делает convert_to_south, проверит и создаст все существующие таблицы; вместо этого вы с помощью --fake указываете South, что это уже сделано, так что следующие миграции будут применены корректно).

source: Remember that new installations of the codebase after this don't need these steps; you need only do a syncdb then a normal migrate.
ru: Помните, что новые установки кода после этого не потребуют этих шагов, Вам нужно будет лишь сделать syncdb а, затем, провести нормальную миграцию.
