Repository: RaD/django-south
Catalog: docs/locale/*/LC_MESSAGES/dependencies.po
Languages: ru

source: Dependencies
ru: Зависимости

source: Migrations for apps are nice 'n all, but when you start writing a large project, with a lot of apps, you realise you have foreign key relationships between apps and working out what order migrations would need to be applied in for each app is just painful.
ru: Миграции для приложений хороши во всём, но когда вы начинаете работу над действительно большим проектом, который содержит множество приложений, то вы начинаете создавать связи между этими приложениями и управление порядком применения миграций для каждого приложения становится важной задачей.

source: Luckily, we also had this problem, so South has a dependency system. Inside a migration, you can declare that it depends on having another app having run a certain migration first; for example, if my app "forum" depends on the "accounts" app having created its user profile table, we can do::
ru: К счастью у нас тоже есть такие задачи, поэтому South обладает системой разрешения зависимостей. В миграции вы можете указать, что она требует применения определённой миграции из другого приложения. Например, если моё приложение "forum" зависит от таблицы профиля, которую создаёт приложение "accounts", то мы можем сделать следующее::

source: Then, if you try and migrate to or beyond 0002_post in the forum app, it will first make sure accounts is migrated at least up to 0003_add_user_profile, and if not will migrate it for you.
ru: Затем, если вы попытаетесь применить миграцию 0002_post из приложения форума, South обеспечит выполнение миграций приложения "accounts" как минимум до 0003_add_user_profile, а затем накатит указанную миграцию.

source: Dependencies also work in reverse; South knows not to undo that 0003_add_user_profile migration until it has undone the 0002_post migration.
ru: Зависимости также работают и в обратную сторону. South запрещает откатывать миграцию 0003_add_user_profile, пока не будет откачена миграция 0002_post.

source: You can have multiple dependencies, and all sorts of wacky structures; there are, however, two rules:
ru: Вы можете указывать несколько зависимостей, какие только придут в голову, но следует помнить два правила:

source: No circular dependencies (two or more migrations depending on each other)
ru: Никаких циклических зависимостей. Это когда две или более миграции зависят друг от друга.

source: No upwards dependencies in the same app (so you can't make 0002_post in the forum app depend on 0003_room in the same app, either directly or through a dependency chain.
ru: Никаких зависимостей от будущего. То есть нельзя миграцию 0002_post для приложения форума сделать зависимой от миграции 0000_room того же приложения, неважно, напрямую или через цепочку миграций.

source: Reverse Dependencies
ru: Обратные зависимости

source: South also supports "reverse dependencies" - a dependecy where you say your migration must be run before another, rather than vice-versa. This is useful if you're trying to run a migration before another in a separate, third-party (or unchangeable) code.
ru: South также поддерживает "обратные зависимости". Это такой тип зависимостей, когда вы указываете, что миграция должны быть запущена перед другой, а не наоборот. Это полезно в случае, когда вы пытаетесь запустить свою миграцию перед другой, определённой во внешнем (или неизменяемом) коде.

source: Declaring these is just like the other kind, except you use needed_by::
ru: Синтаксис похож на предыдущий, просто вы используете needed_by::
